Revit 2026 API

# ColorFillSchemeSetEntries Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetEntries(
	IList<ColorFillSchemeEntry> entries
)
```
```vb
Public Sub SetEntries (
	entries As IList(Of ColorFillSchemeEntry)
)
```
```cpp
public:
void SetEntries(
	IList<ColorFillSchemeEntry^>^ entries
)
```
```fsharp
member SetEntries :
        entries : IList<ColorFillSchemeEntry> -> unit
```

#### Parameters

entries IListColorFillSchemeEntry

#### Reference

ColorFillScheme Class

Autodesk.Revit.DB Namespace